1DPyrolysis/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fireFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1200;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   10.;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression on;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;

maxDi           0.25;

maxDeltaT       0.01;

/*
functions
{
    Temperatures_sampleBig
    {
        type               probes;
        functionObjectLibs ("libsampling.so");
        outputControl      runTime; //outputTime;
        writeInterval      1.0;
        region             sampleRegion;
        probeLocations
        (
            ( 0.0 -0.0001 0.0 ) //Start 1st row measurements
            ( 0.0 -0.01839 0.0 )
        );
        fields
        (
            T
        );
    }

    massLossRateFront
    {
        type               faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled            true;
        region             sampleRegion;
        outputControl      runTime; //outputTime;  
        writeInterval      3.0;
        log                false;
        valueOutput        false;
        source             patch;
        sourceName         region0_to_sampleRegion_sample;
        surfaceFormat      vtk; 
        operation          sum;
        fields
        (
            phiGas
        );
    }

    massLossRateBack
    {
        type               faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled            true;
        region             sampleRegion;
        outputControl      runTime; //outputTime;  
        writeInterval      3.0;
        log                false;
        valueOutput        false;
        source             patch;
        sourceName         sample_top;
        surfaceFormat      vtk; 
        operation          sum;
        fields
        (
            phiGas
        );
    }
}
*/
// ************************************************************************* //
